### Pandas basic tasks

In [1]:
import pandas as pd

### 1

In [4]:
data={'Name':['Jahana','Jinu','Shalu'],
     'Age':[22,15,25]}
df=pd.DataFrame(data)
df['Voting eligibility']=['Eligible' if age>=18 else 'Not Eligible' for age in df['Age']]
df

     Name  Age Voting eligibility
0  Jahana   22           Eligible
1    Jinu   15       Not Eligible
2   Shalu   25           Eligible

### 3

In [3]:
org_series=pd.Series([100,200,'python',300.12,400])
print(org_series)
data=pd.Series(['new data'])
new_series=org_series.append(data,ignore_index=True)
print(new_series)

0       100
1       200
2    python
3    300.12
4       400
dtype: object
0         100
1         200
2      python
3      300.12
4         400
5    new data
dtype: object

C:\Users\DELL\AppData\Local\Temp\ipykernel_33280\430807782.py:4: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  new_series=org_series.append(data,ignore_index=True)

In [5]:

org_series = pd.Series([100, 200, 'python', 300.12, 400])
print(org_series)
data = pd.Series(['new data'])
new_series = pd.concat([org_series, data], ignore_index=True)
print(new_series)

0       100
1       200
2    python
3    300.12
4       400
dtype: object
0         100
1         200
2      python
3      300.12
4         400
5    new data
dtype: object

### 4

In [7]:
data={'Name':['Jahana','Jinu','Shalu'],
     'Age':[22,15,25],
     'Place':['Mlprm','Plkd','Kochi']}
df=pd.DataFrame(data)
order=['Place','Name','Age']
df=df[order]
df

   Place    Name  Age
0  Mlprm  Jahana   22
1   Plkd    Jinu   15
2  Kochi   Shalu   25

### 5

In [4]:
d={'city':['California','Georgia','Los Angeles','California','Georgia','Los Angeles'],
  'people':[4,2,4,4,2,4]}
df=pd.DataFrame(d)
city_people=df.groupby('city')['people'].sum()
print(city_people)

city
California     8
Georgia        4
Los Angeles    8
Name: people, dtype: int64

### 6

In [15]:
series1=pd.Series([2,4,6,8])
series2=pd.Series([1,3,5,7])
add=series1+series2
sub=series1-series2
mul=series1*series2
div=series1/series2
df = pd.DataFrame({
    'series1': series1,
    'series2': series2,
    'add': add,
    'sub': sub,
    'mul': mul,
    'div': div
})

df

   series1  series2  add  sub  mul       div
0        2        1    3    1    2  2.000000
1        4        3    7    1   12  1.333333
2        6        5   11    1   30  1.200000
3        8        7   15    1   56  1.142857

### 7

In [19]:
s1=pd.Series([4,3,2,7,1])
s2=pd.Series(sorted(s1.values))
print(s1)
print("After sorting: ")
print(s2)

0    4
1    3
2    2
3    7
4    1
dtype: int64
After sorting:
0    1
1    2
2    3
3    4
4    7
dtype: int64

### 8

In [2]:
import pandas as pd
import numpy as np
data={'name':['Asha','Radha','Kamal','Divy','Anjali'],
     'height':[5.5,5,np.nan,5.9,np.nan],
     'age':[11,23,22,32,22]}
df=pd.DataFrame(data)
row_nan=df[df['height'].isna()]
row_nan

     name  height  age
2   Kamal     NaN   22
4  Anjali     NaN   22

### 9

In [4]:
data={'Manasvi':['Physics','Chemistry','English','Maths','Computer sc'],\
     'marks':[89,99,97,99,98]}
df=pd.DataFrame(data)
sum_=df['marks'].sum()
print(sum_)

482

### 10

In [7]:
data={'Name':['student1','student2','student3'],
     'Roll number':[50,51,52],
     'subject1':np.random.randint(50,100,size=3),
     'subject2':np.random.randint(50,100,size=3),
     'subject3':np.random.randint(50,100,size=3),
     'subject4':np.random.randint(50,100,size=3),
     'subject5':np.random.randint(50,100,size=3),}
df=pd.DataFrame(data)
df['percentage']=df[['subject1','subject2','subject3','subject4','subject5']].mean(axis=1)
df

,Name,Roll number,subject1,subject2,subject3,subject4,subject5,percentage
0,student1,50,89,93,58,52,82,74.8
1,student2,51,80,52,68,84,75,71.8
2,student3,52,87,84,78,97,67,82.6